In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','c','d'],[1,2,3,3,1,3,4,5,6,0]])
data

a  1   -0.548891
   2    0.381117
   3   -0.480098
b  3   -1.342844
   1   -0.951678
   3   -2.107238
c  4   -2.078081
   5   -1.467810
   6    0.688896
d  0    0.272152
dtype: float64

In [3]:
data.index
data['a'][2]
data.iloc[:5]
# data.unstack()

a  1   -0.548891
   2    0.381117
   3   -0.480098
b  3   -1.342844
   1   -0.951678
dtype: float64

In [32]:
# data.unstack()
data = pd.Series(np.arange(9),index=[['a','a','a','b','b','b','c','c','c'],[1,2,3,1,2,3,1,2,3]])
data.unstack().stack()

a  1    0
   2    1
   3    2
b  1    3
   2    4
   3    5
c  1    6
   2    7
   3    8
dtype: int32

In [48]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame
frame.index.names=['Key','SubKey']
frame.columns.names=['States','Colours']
frame

States      Ohio     Colorado
Colours    Green Red    Green
Key SubKey
a   1          0   1        2
    2          3   4        5
b   1          6   7        8
    2          9  10       11

In [51]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                          ['Green', 'Red', 'Green']],
                          names=['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [62]:
# frame.MultiIndex.from_arrays()

In [70]:
frame.swaplevel('Key','SubKey')
# frame

States      Ohio     Colorado
Colours    Green Red    Green
SubKey Key
1      a       0   1        2
2      a       3   4        5
1      b       6   7        8
2      b       9  10       11

In [74]:
frame.swaplevel(0,1).sort_index(level=1)
# frame.sort_index(level=0),frame

States      Ohio     Colorado
Colours    Green Red    Green
SubKey Key
1      a       0   1        2
2      a       3   4        5
1      b       6   7        8
2      b       9  10       11

In [84]:
frame.swaplevel(0,1).sort_index(level=0)
frame.sum(level='Key',axis=0)

States   Ohio     Colorado
Colours Green Red    Green
Key
a           3   5        7
b          15  17       19

In [96]:
df = pd.DataFrame({
    'a':range(5),'b':range(5,0,-1),
    'c':['one','one','two','two','three'],
    'd':['a','a','b','b','c']
})
df
df2=df.set_index(['c','d'])

In [107]:
df2['a']

c      d
one    a    0
       a    1
two    b    2
       b    3
three  c    4
Name: a, dtype: int64

In [119]:
df1= pd.DataFrame({
    'key':['a','a','a','b','c','c'],
    'data1':range(6)
})

df2 = pd.DataFrame({
    'key':['a','b','c','d'],
    'data2':range(4)
})
df = pd.merge(df1,df2)
df1,df2,df

(  key  data1
 0   a      0
 1   a      1
 2   a      2
 3   b      3
 4   c      4
 5   c      5,
   key  data2
 0   a      0
 1   b      1
 2   c      2
 3   d      3,
   key  data1  data2
 0   a      0      0
 1   a      1      0
 2   a      2      0
 3   b      3      1
 4   c      4      2
 5   c      5      2)

In [121]:
df =  pd.merge(df1,df2,how='outer')
df

  key  data1  data2
0   a    0.0      0
1   a    1.0      0
2   a    2.0      0
3   b    3.0      1
4   c    4.0      2
5   c    5.0      2
6   d    NaN      3

In [10]:
left = pd.DataFrame(np.random.randn(12).reshape(3,4),index=['a','b','c'],columns=[1,2,3,4])

right = pd.DataFrame(np.random.randn(12).reshape(3,4),index=['d','e','f'],columns=[-1,0,1,2])

df= pd.merge(left,right,left_index=True,right_index=True,how='outer')
df

,1_x,2_x,3,4,-1,0,1_y,2_y
a,-0.594296,0.463103,1.315921,0.062098,NaN,NaN,NaN,NaN
b,2.163883,0.539345,1.401064,1.455001,NaN,NaN,NaN,NaN
c,-1.190874,-0.740357,0.579834,0.886388,NaN,NaN,NaN,NaN
d,NaN,NaN,NaN,NaN,1.341373,0.36849,-0.181444,-1.644886
e,NaN,NaN,NaN,NaN,-0.782506,0.62408,0.523184,-0.609136
f,NaN,NaN,NaN,NaN,0.252241,-1.01801,-1.448726,-2.448526

In [14]:
# data = pd.merge(left,right,on=['a','b','c'],how='outer')

In [26]:
left1= pd.DataFrame({'key1':['jai','raj','india'],'value1':np.arange(3)},index=['a','b','c'])

right1 = pd.DataFrame({'key1':['jai23','raj2','india2'],'value2':range(3)},index=['d','e','f'])

df1 = pd.merge(left1,right1,left_on='key1',right_index=True)
df1

Empty DataFrame
Columns: [key1, key1_x, value1, key1_y, value2]
Index: []

In [32]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
   ....:                       'value': range(6)})

right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

df2= pd.merge(left1,right1,left_on='key',right_index=True)

df2.sort_index(0)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

In [34]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
   ....:                                'Nevada', 'Nevada'],
   ....:                       'key2': [2000, 2001, 2002, 2001, 2002],
   ....:                       'data': np.arange(5.)})

In [65]: righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
   ....:                       index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
   ....:                               'Ohio', 'Ohio'],
   ....:                              [2001, 2000, 2000, 2000, 2001, 2002]],
   ....:                       columns=['event1', 'event2'])

In [42]:
lefth,righth
data1 = pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

data2 = pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True,how='outer')

data1,data2
lefth
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [50]:
data3 = pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)
data3

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [59]:
data4 = left1.join(right1,how='outer')
data4
df2,data4

(  key  value  group_val
 0   a      0        3.5
 2   a      2        3.5
 3   a      3        3.5
 1   b      1        7.0
 4   b      4        7.0,
    key  value  group_val
 0    a    0.0        NaN
 1    b    1.0        NaN
 2    a    2.0        NaN
 3    a    3.0        NaN
 4    b    4.0        NaN
 5    c    5.0        NaN
 a  NaN    NaN        3.5
 b  NaN    NaN        7.0)

In [68]:
arr= np.arange(16).reshape(4,4)
arr
np.concatenate([arr,arr],axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [83]:
rf = pd.DataFrame({'key':range(4),'value':['s','d','f','g']},index=['q','w','e','r'])
rf

lf = pd.DataFrame({'key':range(4,0,-1),'value':['sa','ds','fd','gh']},index=['q1','w2','e3','r4'])

fg = pd.concat([rf,lf],ignore_index=True)
fg
rf.unstack(),rf

(key    q    0
        w    1
        e    2
        r    3
 value  q    s
        w    d
        e    f
        r    g
 dtype: object,
    key value
 q    0     s
 w    1     d
 e    2     f
 r    3     g)

In [98]:
titn= pd.read_csv('train.csv')
titn.head()

air = pd.read_csv('openaq.csv')
air.head()
data = year  quarter   realgdp  realcons  realinv  realgovt  realdpi    cpi  \
0  1959.0      1.0  2710.349    1707.4  286.898   470.045   1886.9  28.98   
1  1959.0      2.0  2778.801    1733.7  310.859   481.301   1919.7  29.15   
2  1959.0      3.0  2775.488    1751.8  289.226   491.260   1916.4  29.35   
3  1959.0      4.0  2785.204    1753.7  299.356   484.052   1931.3  29.37   
4  1960.0      1.0  2847.699    1770.5  331.722   462.199   1955.5  29.54   
      m1  tbilrate  unemp      pop  infl  realint  
0  139.7      2.82    5.8  177.146  0.00     0.00  
1  141.7      3.08    5.1  177.830  2.34     0.74  
2  140.5      3.82    5.3  178.657  2.74     1.09  
3  140.0      4.33    5.6  179.386  0.27     4.06  
4  139.6      3.50    5.2  180.007  2.31     1.19

SyntaxError: invalid syntax (<ipython-input-98-3f6d103d7efe>, line 6)